var chartDom = document.getElementById('countrycompare');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图3  世界女性人口性别比与国家议会中女性占比',
        top:'3%',
        left:'2%'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },
    legend: {right:'5%',
        top:'3%',
        align:'right',
        orient:"vertical"},
    grid: {
        left: '3%',
        right: '4%',
        top:'18%',
        bottom: '8%',
        containLabel: true
    },
    xAxis: [
        {
            type: 'category',
            data: [
                '1997',
                    '1998',
                '1999',
                '2000',
                '2001',
                '2002',
                '2003',
                '2004',
                '2005',
                '2006',
                '2007',
                '2008',
                '2009',
                '2010',
                '2011',
                '2012',
                '2013',
                '2014',
                '2015',
                '2016',
                '2017',
                '2018',
                '2019',
                '2020',
                '2021'
            ]
        }
    ],
    yAxis: [
        {
            type: 'value'
        }
    ],
    series: [
        {
            name: '女性总人数占比',
            type: 'bar',
            emphasis: {
                focus: 'series'
            },
            data: [
                50.13, 50.14, 50.16, 50.16, 50.16, 50.16, 50.15, 50.13, 50.11, 50.08,
                50.05, 50.02, 50.0, 49.98, 49.97, 49.96, 49.95, 49.95, 49.94, 49.92,
                49.91, 49.89, 49.88, 49.87, 49.87
            ]
        },
        {
            name: '国家议会女性占比',
            type: 'bar',
            stack: 'Ad',
            emphasis: {
                focus: 'series'
            },
            data: [
                10.25, 10.8, 11.23, 11.74, 12.1, 13.51, 13.82, 14.38, 15.28, 15.49,
                16.54, 16.72, 17.35, 17.39, 18.17, 18.97, 19.83, 20.12, 20.59, 20.97,
                21.41, 21.97, 22.83, 23.9, 24.74
            ]
        }
    ],
    graphic: [
        {
            type:'group',
            left:0,
            top:'bottom',
            children:[
                {
                    type:'text',
                    z:100,
                    left:45,
                    top:13,
                    style:{
                        text:'数据来源:Inter-Parliamentary Union (https://www.ipu.org/)',
                        fontSize:'10',
                        bottom:'5%',
                        fill:'#868686'
                    },
                },
            ],
        }]
};

option && myChart.setOption(option);






var chartDom = document.getElementById('alianqiuduibi');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图6  阿联酋女性人口性别比与国家议会中女性占比',
        top:'3%',
        left:'2%'
    },
    grid: {
        left: '3%',
        right: '4%',
        top:'18%',
        bottom: '8%',
        containLabel: true
    },
    legend: {right:'5%',
        top:'3%',
        align:'right',
        orient:"vertical",
        data: ['阿联酋女性总人口占比', '阿联酋国家议会女性占比']
    },
    boundaryGap:
        [0,0.5],
    tooltip: {
        trigger: 'axis'
    },
    xAxis: {
        type: 'category',
        data: [
            '1997',
            '1998',
            '1999',
            '2000',
            '2001',
            '2002',
            '2003',
            '2004',
            '2005',
            '2006',
            '2007',
            '2008',
            '2009',
            '2010',
            '2011',
            '2012',
            '2013',
            '2014',
            '2015',
            '2016',
            '2017',
            '2018',
            '2019',
            '2020',
            '2021'
        ]
    },
    yAxis: {
        type: 'value'
    },
    series: [
        {
            name: '阿联酋女性总人口占比',
            data: [
                33.24, 33.01, 32.75, 32.45, 32.22, 32.02, 31.62, 30.81, 29.61, 28.17,
                26.77, 25.72, 25.19, 25.19, 25.69, 26.56, 27.67, 28.75, 29.6, 30.16,
                30.48, 30.64, 30.74, 30.88, 31.06
            ],
            type: 'line'
        },
        {
            name: '阿联酋国家议会女性占比',
            type: 'line',
            data: [
                0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 0.0, 5.0, 22.5, 22.5, 22.5,
                22.5, 17.5, 17.5, 17.5, 17.5, 22.5, 22.5, 22.5, 22.5, 50.0, 50.0, 50.0
            ]
        }
    ],
    graphic: [
        {
            type:'group',
            left:0,
            bottom:'4%',
            children:[
                {
                    type:'text',
                    z:100,
                    left:45,
                    top:13,
                    style:{
                        text:'数据来源:Inter-Parliamentary Union (https://www.ipu.org/)',
                        fontSize:'10',
                        fill:'#868686'
                    },
                },
            ],
        }]
};

option && myChart.setOption(option);


var chartDom = document.getElementById('baogao2');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图2  迄今已消除的性别差距（按区域分列）',
        top:'3%',
        left:'2%'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },

    grid: {
        left: '3%',
        right: '4%',
        bottom: '9%',
        containLabel: true
    },
    xAxis: {
        type: 'value',
        name: '全球性别差距指数GGGI百分比(%)',
        nameLocation:'middle',
        boundaryGap: [0, 0.01],
        nameGap: '35'
    },
    yAxis: {
        type: 'category',
        data: ['南亚','中东和北非', '撒哈拉以南非洲','东亚和太平洋地区', '中亚', '拉丁美洲和加勒比海地区', '欧洲','北美']
    },
    series: [
        {
            name: 'GGGI',
            type: 'bar',
            barWidth:'55%',
            colorBy:'data',
            color:['rgb(105,130,202)','rgb(88,116,196)','rgb(79,104,176)','rgb(70,93,157)','rgb(62,81,137)','rgb(53,70,118)','rgb(44,58,98)','rgb(35,46,78)'],

            data: [62.4,63.4,67.8,69.0,69.1,72.6,76.6,76.9]
        },
    ],
    graphic: [
        {
            type:'group',
            left:0,
            top:'bottom',
            children:[
                {
                    type:'text',
                    z:100,
                    left:45,
                    top:13,
                    style:{
                        text:'数据来源:\nWORLD ECONOMIC FORUM《Global Gender Gap Report 2022》',
                        fontSize:'10',
                        fill:'#868686'
                    },
                },
            ],
        }]
};

option && myChart.setOption(option);

var chartDom = document.getElementById('baogao1');
var myChart = echarts.init(chartDom);
var option;
option = {
    title: {
        text: '图1  性别差距状况（按分项指数）',
        top:'3%',
        left:'2%'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },
    legend: {
        right:'5%',
        top:'3%',
        align:'right',
        orient:"vertical"
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '9%',
        containLabel: true
    },
    xAxis: {
        type: 'value',
        name: '分项指数百分比(%)',
        nameLocation:'middle',
        boundaryGap: [0, 0.01],
        nameGap: '35'
    },
    yAxis: {
        type: 'category',
        data: ['政治赋权指数','医疗与生存指数','教育程度指数','经济参与和贡献指数','全球性别差距指数']
    },
    series: [
        {
            name: '分项指数',
            type: 'bar',
            barWidth:'45%',
            showBackground: true,
            colorBy:'data',
            color:['rgb(187,95,86)','rgb(189,189,189)','rgb(189,189,189)','rgb(189,189,189)','rgb(84,112,198)'],
            data: [22,95.8,94.4,60.3,68.1]
        },
    ],
    graphic: [
        {
            type:'group',
            left:0,
            top:'bottom',
            children:[
                {
                    type:'text',
                    z:100,
                    left:45,
                    top:13,
                    style:{
                        text:'数据来源:WORLD ECONOMIC FORUM《Global Gender Gap Report 2022》',
                        fontSize:'10',
                        fill:'#868686'
                    },
                },
            ],
        }]
};
option && myChart.setOption(option);



var chartDom = document.getElementById('fenlannannv1');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图8  芬兰社会状况性别对比',
        top: '3%',
        left: '2%'
    },
    tooltip: {
        trigger: 'axis',
        axisPointer: {
            type: 'shadow'
        }
    },
    legend: {
        right: '5%',
        top: '3%',
        align: 'right',
        orient: 'vertical'
    },
    grid: {
        left: '3%',
        right: '4%',
        bottom: '5%',
        top: '20%',
        containLabel: true
    },
    xAxis: {
        type: 'category',
        data: ['失业率', '年度大专以上学历比', '就业率']
    },
    yAxis: {
        type: 'value',
        name: '百分数（%）'
    },
    series: [
        {
            name: '女性',
            type: 'bar',
            barWidth: '25%',
            showBackground: true,
            data: [7.3, 76, 80.1]
        },
        {
            name: '男性',
            type: 'bar',
            barWidth: '25%',
            showBackground: true,
            data: [7.5, 73, 80.55]
        }
    ],
    graphic: [
        {
            type: 'group',
            left: 0,
            top: 'bottom',
            children: [
                {
                    type: 'text',
                    z: 100,
                    left: 45,
                    top: 13,
                    style: {
                        text: '数据来源:芬兰国家统计局',
                        fontSize: '10',
                        fill: '#868686'
                    }
                }
            ]
        }
    ]
};

option && myChart.setOption(option);


var chartDom = document.getElementById('luwangda');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图5  192国议会中的女性占比变化图 | 卢旺达',
        top: '3%',
        left: '2%'
    },
    tooltip: {
        trigger: 'item',
        axisPointer: {
            type: 'cross'
        }
    },
    legend: {
        right: '5%',
        top: '3%',
        align: 'right',
        orient: 'vertical',
        data: ['卢旺达']
    },

    grid: {
        left: '3%',
        right: '4%',
        bottom: '8%',
        containLabel: true
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    xAxis: {
        type: 'category',
        data: [
            1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
            2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020,
            2021
        ]
    },
    yAxis: {
        type: '',
        boundaryGap: [0, 0.3]
    },
    series: [
        {
            name: '阿拉伯联合酋长国',
            type: 'line',
            lineStyle: {
                width: 1
            },
            color: '#D0D0D0',
            data: [
                0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 22.5, 22.5, 22.5, 22.5, 17.5, 17.5, 17.5,
                17.5, 22.5, 22.5, 22.5, 22.5, 50, 50, 50
            ]
        },
        {
            name: '卢旺达',
            type: 'line',
            smooth: true,
            legendHoverLink: true,
            symbolSize: 7,
            lineStyle: {
                width: 2
            },
            color: 'rgb(187,95,86)',

            data: [
                17.14, 17.14, 17.14, 25.71, 25.68, 25.68, 48.75, 48.75, 48.75, 48.75,
                48.75, 56.25, 56.25, 56.25, 56.25, 56.25, 63.75, 63.75, 63.75, 63.75,
                61.25, 61.25, 61.25, 61.25, 61.25
            ]
        },
        {
            name: '安道尔共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.14, 7.14, 7.14, 7.14, 14.29, 14.29, 14.29, 14.29, 28.57, 28.57, 28.57,
                25, 35.71, 35.71, 50, 50, 50, 50, 39.29, 32.14, 32.14, 32.14, 46.43,
                46.43, 46.43
            ]
        },
        {
            name: '玻利维亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                11.54,
                11.54,
                11.54,
                18.46,
                18.46,
                19.23,
                16.92,
                16.92,
                16.92,
                16.92,
                22.31,
                25.38,
                25.38,
                25.38,
                25.38,
                53.08,
                53.08,
                53.08,
                53.08,
                53.08,
                53.08,
                46.15,
                46.15
            ]
        },
        {
            name: '尼加拉瓜',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.75,
                10.75,
                9.68,
                9.68,
                '-',
                20.65,
                20.65,
                20.65,
                20.65,
                15.22,
                18.48,
                18.48,
                20.65,
                20.65,
                40.22,
                40.22,
                40.22,
                42.39,
                41.3,
                45.65,
                45.65,
                45.65,
                44.57,
                47.25,
                50.55
            ]
        },
        {
            name: '埃塞俄比亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.05, 2.05, 2.03, 7.69, 7.68, 7.68, 7.68, 7.68, 21.43, 21.93, 21.93,
                21.93, 21.93, 27.79, 27.79, 27.79, 27.79, 27.79, 38.76, 38.76, 38.76,
                38.76, 38.76, 38.76, 42.59
            ]
        },
        {
            name: '北马其顿',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.33, 3.33, 7.5, 6.67, 6.67, 17.5, 18.33, 19.17, 19.17, 28.33, 29.17,
                31.67, 32.5, 32.5, 30.89, 32.52, 34.15, 33.33, 33.33, 33.33, 37.5,
                38.33, 39.17, 39.17, 41.67
            ]
        },
        {
            name: '厄瓜多尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.66,
                17.36,
                17.36,
                14.63,
                14.63,
                '-',
                16,
                16,
                16,
                25,
                25,
                25,
                32.26,
                32.26,
                32.26,
                32.26,
                38.69,
                41.61,
                41.61,
                41.61,
                37.96,
                37.96,
                37.96,
                39.42,
                39.42
            ]
        },
        {
            name: '墨西哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                14.2, 17.4, 18.2, 16, 16, 16, 22.6, 22.6, 24.2, 22.6, 23.2, 23.2, 27.6,
                26.2, 26.2, 36.8, 36.8, 37.4, 42.37, 42.4, 42.6, 48.2, 48.2, 48.2, 50
            ]
        },
        {
            name: '摩尔多瓦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.81,
                '-',
                8.91,
                7.92,
                12.87,
                12.87,
                12.87,
                15.84,
                21.78,
                21.78,
                21.78,
                21.78,
                23.76,
                18.81,
                19.8,
                19.8,
                19.8,
                17.82,
                21.78,
                21.78,
                22.77,
                22.77,
                25.74,
                24.75,
                39.6
            ]
        },
        {
            name: '古巴',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                22.75, 27.62, 27.62, 27.62, 27.62, 27.62, 35.96, 35.96, 35.96, 35.96,
                35.96, 43.16, 43.16, 43.16, 45.22, 45.22, 48.86, 48.86, 48.86, 48.86,
                48.86, 53.22, 53.22, 53.22, 53.41
            ]
        },
        {
            name: '阿尔巴尼亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                5.16,
                5.16,
                5.71,
                5.71,
                5.71,
                6.43,
                7.14,
                7.14,
                7.14,
                7.14,
                16.43,
                16.43,
                15.71,
                15.71,
                17.86,
                20,
                20.71,
                22.86,
                27.86,
                27.86,
                29.51,
                29.51,
                35.71
            ]
        },
        {
            name: '哥斯达黎加',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.79, 19.3, 19.3, 19.3, 19.3, 35.09, 35.09, 35.09, 35.09, 38.6, 36.84,
                36.84, 36.84, 38.6, 38.6, 38.6, 38.6, 33.33, 33.33, 33.33, 35.09, 45.61,
                45.61, 45.61, 45.61
            ]
        },
        {
            name: '尼泊尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.41,
                3.41,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.88,
                17.33,
                33.16,
                33.16,
                33.16,
                33.16,
                33.16,
                '-',
                29.48,
                29.55,
                29.58,
                29.58,
                32.73,
                32.73,
                32.73,
                32.73
            ]
        },
        {
            name: '白俄罗斯',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                10.31,
                10.31,
                10.31,
                29.36,
                29.09,
                29.09,
                29.09,
                31.82,
                31.82,
                31.82,
                31.82,
                26.61,
                26.61,
                26.61,
                27.27,
                34.55,
                34.55,
                34.55,
                40,
                40,
                40
            ]
        },
        {
            name: '比利时',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                12.67, 12.67, 23.33, 23.33, 23.33, 23.33, 35.33, 34.67, 34.67, 34.67,
                35.33, 35.33, 38, 39.33, 38, 38, 38, 39.33, 39.33, 39.33, 38, 38, 42,
                41.33, 42
            ]
        },
        {
            name: '秘鲁',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.83,
                10.83,
                10.83,
                '-',
                18.33,
                18.33,
                18.33,
                18.33,
                18.33,
                29.17,
                29.17,
                29.17,
                27.5,
                27.5,
                21.54,
                21.54,
                21.54,
                22.31,
                22.31,
                27.69,
                27.69,
                27.69,
                30,
                26.15,
                40
            ]
        },
        {
            name: '安哥拉',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                9.55, 15.45, 15.45, 15.45, 15.45, 15.45, 15.45, 15, 15, 15, 15, 37.27,
                38.64, 38.64, 38.18, 34.09, 34.09, 36.82, 36.82, 36.82, 30.45, 30.45,
                30, 30, 29.55
            ]
        },
        {
            name: '法国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                [
                    10.92, 10.92, 10.92, 10.92, 10.92, 12.13, 12.2, 12.2, 12.2, 12.2,
                    18.2, 18.2, 18.89, 18.89, 18.89, 26.86, 26.86, 26.17, 26.17, 26.17,
                    38.99, 39.58, 39.69, 39.51, 39.51
                ]
            ]
        },
        {
            name: '摩纳哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.56, 22.22, 22.22, 22.22, 22.22, 22.22, 20.83, 20.83, 20.83, 20.83,
                20.83, 25, 26.09, 26.09, 19.05, 19.05, 20.83, 20.83, 20.83, 20.83,
                20.83, 33.33, 33.33, 33.33, 33.33
            ]
        },
        {
            name: '塞尔维亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                12,
                20.4,
                21.6,
                21.6,
                21.6,
                22,
                33.2,
                33.2,
                34,
                34,
                34,
                34.4,
                34.4,
                37.65,
                38.8,
                39.2
            ]
        },
        {
            name: '葡萄牙',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.04, 13.04, 18.7, 17.39, 18.7, 19.13, 19.13, 19.13, 21.3, 21.3, 28.26,
                28.26, 27.39, 27.39, 28.7, 28.7, 31.3, 31.3, 34.78, 34.78, 34.78, 34.78,
                38.7, 40, 40
            ]
        },
        {
            name: '阿拉伯埃及共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                1.98,
                1.98,
                1.98,
                1.98,
                2.42,
                2.42,
                2.42,
                2.86,
                1.98,
                2.04,
                1.81,
                1.81,
                1.76,
                12.7,
                1.97,
                1.97,
                '-',
                '-',
                '-',
                14.93,
                14.93,
                14.93,
                14.93,
                27.41,
                27.7
            ]
        },
        {
            name: '意大利',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.11, 11.11, 11.11, 11.11, 9.84, 9.84, 11.49, 11.53, 11.53, 17.3, 17.3,
                21.27, 21.27, 21.27, 21.59, 21.43, 31.43, 31.43, 30.95, 30.95, 30.95,
                35.71, 35.71, 35.71, 35.71
            ]
        },
        {
            name: '新加坡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.76, 4.76, 4.3, 4.3, 11.76, 11.76, 15.96, 15.96, 15.96, 21.18, 24.47,
                24.47, 23.4, 23.4, 22.22, 24.24, 24.24, 25.25, 23.91, 23.76, 23, 23, 23,
                29.47, 29.81
            ]
        },
        {
            name: '苏丹',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.25,
                5.25,
                '-',
                '-',
                9.72,
                9.72,
                9.72,
                9.72,
                14.67,
                17.78,
                18.06,
                18.06,
                18.92,
                25.56,
                24.58,
                24.58,
                24.58,
                24.29,
                30.52,
                30.52,
                30.52,
                30.52,
                '-',
                '-',
                '-'
            ]
        },
        {
            name: '克罗地亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.87,
                7.87,
                7.87,
                20.53,
                20.53,
                20.53,
                '-',
                21.71,
                21.71,
                21.71,
                20.92,
                20.92,
                23.53,
                23.53,
                23.84,
                23.84,
                23.84,
                23.84,
                15.23,
                12.58,
                18.54,
                18.54,
                20.53,
                31.13,
                31.13
            ]
        },
        {
            name: '伊拉克',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.4,
                6.4,
                6.4,
                7.6,
                7.6,
                7.6,
                '-',
                '-',
                '-',
                25.45,
                25.45,
                25.45,
                25.45,
                25.23,
                25.23,
                25.23,
                25.23,
                25.3,
                26.52,
                26.52,
                25.3,
                25.23,
                25.23,
                26.44,
                28.88
            ]
        },
        {
            name: '西班牙',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                24.71, 24.71, 21.55, 28.29, 28.29, 28.29, 28.29, 36, 36, 36, 36.57,
                36.29, 36.57, 36.57, 36, 36, 36, 39.71, 41.14, 39.14, 39.14, 39.14, 44,
                44, 43.43
            ]
        },
        {
            name: '冰岛',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                25.4, 25.4, 34.92, 34.92, 34.92, 34.92, 30.16, 30.16, 33.33, 33.33,
                33.33, 33.33, 42.86, 42.86, 39.68, 39.68, 39.68, 39.68, 41.27, 47.62,
                38.1, 38.1, 38.1, 38.1, 47.62
            ]
        },
        {
            name: '摩洛哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                0.62, 0.62, 0.62, 0.62, 0.62, 10.77, 10.77, 10.77, 10.77, 10.77, 10.46,
                10.46, 10.46, 10.46, 16.96, 16.96, 16.96, 16.96, 16.96, 20.51, 20.51,
                20.51, 20.51, 20.51, 22.78
            ]
        },
        {
            name: '南非',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                25, 28.75, 30, 29.82, 29.82, 29.82, 29.82, 32.78, 32.75, 32.75, 33, 33,
                44.5, 44.5, 42.25, 42.25, 42.25, 41.5, 42, 42, 41.84, 42.75, 46.35,
                46.75, 46.58
            ]
        },
        {
            name: '瑞士',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                21, 21, 22.5, 23, 23, 23, 25, 25, 25, 25, 28.5, 28.5, 29, 29, 28.5, 29,
                31, 31, 32, 32, 32.5, 32.5, 41.5, 41.5, 42.5
            ]
        },
        {
            name: '新西兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                29.17, 29.17, 29.17, 30.83, 30.83, 29.17, 28.33, 28.33, 32.23, 32.23,
                33.06, 33.61, 33.61, 33.61, 32.23, 32.23, 32.23, 29.75, 31.4, 31.4,
                38.33, 38.33, 40.83, 48.33, 49.17
            ]
        },
        {
            name: '以色列',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.5, 7.5, 11.67, 12.5, 13.33, 14.17, 15, 15, 15, 14.17, 14.17, 14.17,
                18.33, 19.17, 20, 20, 22.5, 22.5, 26.67, 26.67, 27.5, 27.5, 23.33, 27.5,
                28.33
            ]
        },
        {
            name: '菲律宾',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.06, 12.44, 12.44, 11.26, 17.76, 17.76, 17.76, 15.25, 15.25, 15.25,
                20.5, 20.5, 20.97, 22.14, 22.89, 22.89, 27.34, 27.34, 27.24, 29.79,
                29.45, 29.45, 27.96, 27.96, 27.96
            ]
        },
        {
            name: '卢森堡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20, 20, 16.67, 16.67, 16.67, 16.67, 16.67, 23.33, 23.33, 23.33, 23.33,
                23.33, 20, 20, 25, 21.67, 28.33, 28.33, 28.33, 28.33, 28.33, 20, 25, 30,
                35
            ]
        },
        {
            name: '阿根廷',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                27.63,
                27.63,
                '-',
                26.46,
                '-',
                30.74,
                30.74,
                33.73,
                36.19,
                35.02,
                40,
                40,
                38.52,
                38.52,
                37.35,
                37.35,
                36.58,
                36.58,
                '-',
                35.8,
                38.13,
                38.91,
                40.16,
                40.86,
                44.75
            ]
        },
        {
            name: '哈萨克斯坦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.43, 13.43, 10.81, 10.39, 10.39, 10.39, 10.39, 10.39, 10.39, 10.39,
                15.89, 15.89, 17.76, 17.76, 17.76, 24.3, 24.3, 25.22, 26.17, 27.1, 27.1,
                27.1, 27.1, 27.1, 27.1
            ]
        },
        {
            name: '英国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                18.21, 18.21, 18.36, 18.36, 17.91, 17.91, 17.91, 18.06, 19.66, 19.66,
                19.5, 19.5, 19.5, 22, 22.31, 22.46, 22.46, 22.62, 29.38, 29.58, 32,
                32.15, 32, 33.85, 34.26
            ]
        },
        {
            name: '大韩民国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.01, 3.68, 3.68, 5.86, 5.86, 5.86, 5.86, 13.04, 13.38, 13.38, 14.38,
                13.71, 14.72, 14.72, 14.72, 15.67, 15.67, 16.33, 16.33, 17, 17, 17,
                16.67, 19, 19
            ]
        },
        {
            name: '美国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.72,
                11.72,
                13.33,
                '-',
                14.02,
                13.79,
                14.25,
                14.94,
                15.17,
                16.32,
                16.78,
                17.01,
                16.78,
                16.78,
                16.82,
                17.97,
                17.82,
                19.31,
                19.35,
                19.17,
                19.35,
                23.5,
                23.43,
                27.46,
                27.65
            ]
        },
        {
            name: '波兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.04, 13.04, 13.04, 13.04, 20.22, 20.22, 20.22, 20.22, 20.43, 20.43,
                20.43, 20.22, 20, 20, 23.7, 23.7, 23.7, 24.35, 27.39, 27.39, 28.04,
                28.04, 28.7, 28.7, 28.32
            ]
        },
        {
            name: '澳大利亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.54,
                15.54,
                22.45,
                22.97,
                '-',
                25.33,
                25.33,
                24.67,
                24.67,
                24.67,
                26.67,
                26.67,
                27.33,
                24.67,
                24.67,
                24.67,
                26,
                26,
                26.67,
                28.67,
                28.67,
                28.67,
                30.46,
                30.46,
                31.13
            ]
        },
        {
            name: '希腊',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.33, 6.33, 6.33, 8.67, 8.67, 8.67, 8.67, 14, 13, 13, 14.67, 14.67,
                17.33, 17.33, 18.67, 21, 21, 21, 19.67, 19.67, 18.33, 18.67, 20.67,
                21.67, 21.67
            ]
        },
        {
            name: '土耳其',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.36,
                2.36,
                4.18,
                4.18,
                4.18,
                '-',
                4.36,
                4.36,
                4.36,
                4.36,
                9.11,
                9.11,
                9.11,
                9.11,
                14.18,
                14.18,
                14.42,
                14.42,
                14.91,
                14.91,
                14.57,
                17.45,
                17.45,
                17.32,
                17.33
            ]
        },
        {
            name: '南亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.76, 6.05, 7.01, 8.44, 8.12, 9.09, 9.2, 9.02, 13.28, 12.84, 14.26,
                18.44, 20.05, 20.05, 20.34, 20.34, 15.75, 19.24, 19.32, 19.39, 19.4,
                17.1, 18.96, 18.92, 18.99
            ]
        },
        {
            name: '芬兰',
            type: 'line',
            color: '#D0D0D0',
            lineStyle: {
                width: 1
            },
            data: [
                33.5, 33.5, 37, 36.5, 36.5, 36.5, 37.5, 37.5, 37.5, 38, 41.5, 41.5, 40,
                40, 42.5, 42.5, 42.5, 42.5, 41.5, 41.5, 42, 42, 47, 46, 46
            ]
        },
        {
            name: '荷兰',
            type: 'line',
            color: '#D0D0D0',
            lineStyle: {
                width: 1
            },
            data: [
                31.33, 36, 36, 36, 36, 34, 36.67, 36.67, 36.67, 36.67, 39.33, 41.33, 42,
                40.67, 40.67, 38.67, 38.67, 38.67, 37.33, 37.33, 36, 36, 31.33, 33.33,
                39.33
            ]
        },
        {
            name: '爱尔兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                12.05, 12.05, 12.05, 12.05, 12.05, 13.25, 13.25, 13.25, 13.25, 13.25,
                13.25, 13.25, 13.94, 13.94, 15.06, 15.06, 15.66, 15.66, 16.27, 22.15,
                22.15, 22.15, 22.15, 22.5, 22.5
            ]
        },
        {
            name: '德国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                26.19, 26.19, 30.94, 30.94, 31.08, 32.17, 32.17, 32.75, 31.76, 31.6,
                31.65, 32.19, 32.8, 32.8, 32.9, 32.9, 36.45, 36.45, 36.45, 36.45, 30.75,
                30.75, 30.89, 31.17, 34.92
            ]
        },
        {
            name: '加拿大',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20.6,
                20.6,
                20.6,
                '-',
                20.6,
                20.6,
                20.6,
                21.1,
                21.1,
                20.78,
                21.31,
                22.08,
                22.08,
                22.08,
                24.76,
                24.68,
                24.68,
                25.08,
                26.04,
                26.04,
                26.27,
                26.95,
                28.99,
                28.99,
                30.47
            ]
        },
        {
            name: '加蓬',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                8.33,
                8.33,
                8.33,
                9.17,
                9.17,
                9.24,
                9.24,
                9.24,
                9.24,
                12.5,
                16.67,
                16.67,
                14.66,
                14.66,
                14.17,
                15.79,
                15.79,
                15,
                14.17,
                14.17,
                17.09,
                '-',
                17.91,
                14.79,
                16.2
            ]
        },
        {
            name: '卡塔尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                9.76,
                9.76,
                9.76,
                9.76,
                4.44
            ]
        },
        {
            name: '加蓬',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                8.33,
                8.33,
                8.33,
                9.17,
                9.17,
                9.24,
                9.24,
                9.24,
                9.24,
                12.5,
                16.67,
                16.67,
                14.66,
                14.66,
                14.17,
                15.79,
                15.79,
                15,
                14.17,
                14.17,
                17.09,
                '-',
                17.91,
                14.79,
                16.2
            ]
        },
        {
            name: '巴西',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.63, 6.63, 5.65, 5.65, 6.82, 6.24, 8.58, 8.58, 8.58, 8.77, 8.97, 8.97,
                8.77, 8.58, 8.58, 8.58, 8.58, 9.94, 9.94, 9.94, 10.72, 15.01, 15.01,
                14.62, 15.2
            ]
        },
        {
            name: '挪威',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                36.36, 36.36, 36.36, 36.36, 35.76, 36.36, 36.36, 38.18, 37.87, 37.87,
                36.09, 36.09, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64,
                41.42, 41.42, 40.83, 41.42, 44.97
            ]
        },
        {
            name: '印度',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.16, 8.1, 8.44, 9.01, 8.84, 8.84, 8.84, 8.26, 8.29, 8.26, 9.06, 9.06,
                10.83, 10.83, 11.01, 11.01, 11.01, 11.42, 11.97, 11.97, 11.81, 11.81,
                14.39, 14.36, 14.44
            ]
        },
        {
            name: '马来西亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                7.81,
                7.81,
                7.81,
                7.81,
                5.26,
                12.5,
                12.5,
                12.5,
                12.5,
                12.5,
                12.5,
                9.59,
                10.96,
                10.96,
                10.96,
                10.96,
                10.96,
                9.86,
                12.33,
                12.33,
                12.33,
                10.96
            ]
        },
        {
            name: '瑞典',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                40.4, 40.4, 42.69, 42.69, 42.69, 44.99, 45.27, 45.27, 45.27, 47.28,
                46.99, 46.99, 46.42, 44.99, 44.7, 44.7, 44.99, 44.7, 43.55, 43.55,
                43.55, 46.13, 47.28, 46.99, 46.99
            ]
        },
        {
            name: '丹麦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                32.96,
                37.43,
                37.43,
                37.43,
                '-',
                37.99,
                37.99,
                37.99,
                36.87,
                36.87,
                37.99,
                37.99,
                37.99,
                37.99,
                39.11,
                39.11,
                39.11,
                39.11,
                37.43,
                37.43,
                37.43,
                37.43,
                39.11,
                39.66,
                39.66
            ]
        },
        {
            name: '日本',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.6, 4.6, 4.6, 7.29, 7.29, 7.29, 7.08, 7.08, 8.96, 9.38, 9.38, 9.38,
                11.25, 11.25, 10.83, 7.92, 8.13, 8.13, 9.47, 9.47, 10.11, 10.11, 10.11,
                9.89, 9.68
            ]
        },
        {
            name: '匈牙利',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.4, 8.29, 8.29, 8.29, 8.29, 9.07, 9.84, 9.09, 9.09, 10.36, 11.14,
                11.14, 11.14, 9.07, 8.81, 8.81, 8.81, 10.05, 10.1, 10.1, 10.05, 12.56,
                12.56, 12.06, 13.07
            ]
        },
        {
            name: '中国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                21.82,
                21.82,
                21.78,
                21.78,
                21.78,
                20.23,
                20.23,
                20.27,
                20.27,
                20.62,
                21.33,
                21.33,
                21.33,
                21.32,
                21.32,
                23.4,
                23.4,
                23.62,
                23.62,
                24.25,
                24.9,
                24.94,
                24.94,
                24.94
            ]
        },
        {
            name: '刚果（布）',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                12,
                12,
                12,
                12,
                '-',
                8.53,
                8.53,
                8.53,
                8.53,
                7.3,
                7.3,
                7.3,
                7.3,
                7.3,
                7.35,
                7.35,
                7.35,
                7.35,
                7.35,
                11.26,
                11.26,
                11.26,
                11.26,
                11.26
            ]
        },
        {
            name: '朝鲜民主主义人民共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                '-',
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                15.57,
                15.57,
                15.57,
                15.57,
                15.57,
                16.3,
                16.3,
                16.3,
                16.3,
                16.3,
                17.61,
                17.61,
                17.61
            ]
        },
        {
            name: '斯里兰卡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.33,
                5.33,
                4.89,
                '-',
                '-',
                4.44,
                4.44,
                4.89,
                4.89,
                4.89,
                5.78,
                5.78,
                5.78,
                5.33,
                5.78,
                5.78,
                5.78,
                5.78,
                4.89,
                5.78,
                5.78,
                5.78,
                5.33,
                5.38,
                5.38
            ]
        },
        {
            name: '阿富汗',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                27.31,
                27.31,
                27.69,
                27.69,
                27.31,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                '-',
                27.87,
                27.02,
                27.02
            ]
        },
        {
            name: '乌克兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.78,
                '-',
                7.78,
                7.78,
                7.78,
                '-',
                5.33,
                5.33,
                5.33,
                8.67,
                8.22,
                8.22,
                8,
                8,
                8,
                9.44,
                9.44,
                11.67,
                12.09,
                12.02,
                12.29,
                12.29,
                20.52,
                20.8,
                20.8
            ]
        },
        {
            name: '立陶宛',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                17.52, 17.52, 17.52, 10.64, 10.64, 10.64, 10.64, 21.99, 21.99, 24.82,
                22.7, 17.73, 19.15, 19.15, 19.15, 24.46, 24.11, 24.11, 23.4, 21.28,
                21.28, 21.28, 21.28, 26.95, 27.66
            ]
        },
        {
            name: '牙买加',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.67,
                13.56,
                13.33,
                13.33,
                13.33,
                '-',
                11.67,
                11.67,
                11.67,
                11.67,
                13.33,
                13.33,
                13.33,
                13.33,
                12.7,
                12.7,
                12.7,
                12.7,
                12.7,
                17.46,
                17.46,
                17.46,
                17.46,
                28.57,
                28.57
            ]
        },
        {
            name: '委内瑞拉',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.91,
                5.91,
                12.14,
                '-',
                9.7,
                9.7,
                9.7,
                9.7,
                17.37,
                17.96,
                18.56,
                18.56,
                17.47,
                16.97,
                16.97,
                16.97,
                16.97,
                16.97,
                16.97,
                14.37,
                22.16,
                22.16,
                22.16,
                22.16,
                22.16
            ]
        },
        {
            name: '撒哈拉以南非洲',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.21,
                10.92,
                '-',
                11.59,
                12.28,
                13.47,
                13.71,
                14.74,
                16.24,
                16.64,
                17.31,
                17.8,
                18.46,
                18.74,
                20.54,
                21.38,
                22.46,
                22.16,
                23.64,
                23.81,
                24.02,
                24.07,
                24.08,
                24.87,
                25.93
            ]
        },
        {
            name: '澳大利亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.54,
                15.54,
                22.45,
                22.97,
                '-',
                25.33,
                25.33,
                24.67,
                24.67,
                24.67,
                26.67,
                26.67,
                27.33,
                24.67,
                24.67,
                24.67,
                26,
                26,
                26.67,
                28.67,
                28.67,
                28.67,
                30.46,
                30.46,
                31.13
            ]
        },
        {
            name: '土耳其',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.36,
                2.36,
                4.18,
                4.18,
                4.18,
                '-',
                4.36,
                4.36,
                4.36,
                4.36,
                9.11,
                9.11,
                9.11,
                9.11,
                14.18,
                14.18,
                14.42,
                14.42,
                14.91,
                14.91,
                14.57,
                17.45,
                17.45,
                17.32,
                17.33
            ]
        }
    ],
    graphic: [
        {
            type: 'group',
            left: 0,
            bottom: '4%',
            children: [
                {
                    type: 'text',
                    z: 100,
                    left: 45,
                    top: 13,
                    style: {
                        text: '数据来源:Inter-Parliamentary Union (https://www.ipu.org/)',
                        fontSize: '10',
                        fill: '#868686'
                    }
                }
            ]
        }
    ]
};

option && myChart.setOption(option);


var chartDom = document.getElementById('fenlan');
var myChart = echarts.init(chartDom);
var option;

option = {
    title: {
        text: '图7  192国议会中的女性占比变化图 | 芬兰',
        top: '3%',
        left: '2%'
    },
    tooltip: {
        trigger: 'item',
        axisPointer: {
            type: 'cross'
        }
    },
    legend: {
        right: '5%',
        top: '3%',
        align: 'right',
        orient: 'vertical',
        data: ['芬兰']
    },

    grid: {
        left: '3%',
        right: '4%',
        bottom: '8%',
        containLabel: true
    },
    toolbox: {
        feature: {
            saveAsImage: {}
        }
    },
    xAxis: {
        type: 'category',
        data: [
            1997, 1998, 1999, 2000, 2001, 2002, 2003, 2004, 2005, 2006, 2007, 2008,
            2009, 2010, 2011, 2012, 2013, 2014, 2015, 2016, 2017, 2018, 2019, 2020,
            2021
        ]
    },
    yAxis: {
        type: '',
        boundaryGap: [0, 0.3]
    },
    series: [
        {
            name: '阿拉伯联合酋长国',
            type: 'line',
            lineStyle: {
                width: 1
            },
            color: '#D0D0D0',
            data: [
                0, 0, 0, 0, 0, 0, 0, 0, 0, 5, 22.5, 22.5, 22.5, 22.5, 17.5, 17.5, 17.5,
                17.5, 22.5, 22.5, 22.5, 22.5, 50, 50, 50
            ]
        },
        {
            name: '卢旺达',
            type: 'line',
            lineStyle: {
                width: 1
            },
            color: '#D0D0D0',

            data: [
                17.14, 17.14, 17.14, 25.71, 25.68, 25.68, 48.75, 48.75, 48.75, 48.75,
                48.75, 56.25, 56.25, 56.25, 56.25, 56.25, 63.75, 63.75, 63.75, 63.75,
                61.25, 61.25, 61.25, 61.25, 61.25
            ]
        },
        {
            name: '安道尔共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.14, 7.14, 7.14, 7.14, 14.29, 14.29, 14.29, 14.29, 28.57, 28.57, 28.57,
                25, 35.71, 35.71, 50, 50, 50, 50, 39.29, 32.14, 32.14, 32.14, 46.43,
                46.43, 46.43
            ]
        },
        {
            name: '玻利维亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                11.54,
                11.54,
                11.54,
                18.46,
                18.46,
                19.23,
                16.92,
                16.92,
                16.92,
                16.92,
                22.31,
                25.38,
                25.38,
                25.38,
                25.38,
                53.08,
                53.08,
                53.08,
                53.08,
                53.08,
                53.08,
                46.15,
                46.15
            ]
        },
        {
            name: '尼加拉瓜',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.75,
                10.75,
                9.68,
                9.68,
                '-',
                20.65,
                20.65,
                20.65,
                20.65,
                15.22,
                18.48,
                18.48,
                20.65,
                20.65,
                40.22,
                40.22,
                40.22,
                42.39,
                41.3,
                45.65,
                45.65,
                45.65,
                44.57,
                47.25,
                50.55
            ]
        },
        {
            name: '埃塞俄比亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.05, 2.05, 2.03, 7.69, 7.68, 7.68, 7.68, 7.68, 21.43, 21.93, 21.93,
                21.93, 21.93, 27.79, 27.79, 27.79, 27.79, 27.79, 38.76, 38.76, 38.76,
                38.76, 38.76, 38.76, 42.59
            ]
        },
        {
            name: '北马其顿',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.33, 3.33, 7.5, 6.67, 6.67, 17.5, 18.33, 19.17, 19.17, 28.33, 29.17,
                31.67, 32.5, 32.5, 30.89, 32.52, 34.15, 33.33, 33.33, 33.33, 37.5,
                38.33, 39.17, 39.17, 41.67
            ]
        },
        {
            name: '厄瓜多尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.66,
                17.36,
                17.36,
                14.63,
                14.63,
                '-',
                16,
                16,
                16,
                25,
                25,
                25,
                32.26,
                32.26,
                32.26,
                32.26,
                38.69,
                41.61,
                41.61,
                41.61,
                37.96,
                37.96,
                37.96,
                39.42,
                39.42
            ]
        },
        {
            name: '墨西哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                14.2, 17.4, 18.2, 16, 16, 16, 22.6, 22.6, 24.2, 22.6, 23.2, 23.2, 27.6,
                26.2, 26.2, 36.8, 36.8, 37.4, 42.37, 42.4, 42.6, 48.2, 48.2, 48.2, 50
            ]
        },
        {
            name: '摩尔多瓦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.81,
                '-',
                8.91,
                7.92,
                12.87,
                12.87,
                12.87,
                15.84,
                21.78,
                21.78,
                21.78,
                21.78,
                23.76,
                18.81,
                19.8,
                19.8,
                19.8,
                17.82,
                21.78,
                21.78,
                22.77,
                22.77,
                25.74,
                24.75,
                39.6
            ]
        },
        {
            name: '古巴',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                22.75, 27.62, 27.62, 27.62, 27.62, 27.62, 35.96, 35.96, 35.96, 35.96,
                35.96, 43.16, 43.16, 43.16, 45.22, 45.22, 48.86, 48.86, 48.86, 48.86,
                48.86, 53.22, 53.22, 53.22, 53.41
            ]
        },
        {
            name: '阿尔巴尼亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                5.16,
                5.16,
                5.71,
                5.71,
                5.71,
                6.43,
                7.14,
                7.14,
                7.14,
                7.14,
                16.43,
                16.43,
                15.71,
                15.71,
                17.86,
                20,
                20.71,
                22.86,
                27.86,
                27.86,
                29.51,
                29.51,
                35.71
            ]
        },
        {
            name: '哥斯达黎加',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.79, 19.3, 19.3, 19.3, 19.3, 35.09, 35.09, 35.09, 35.09, 38.6, 36.84,
                36.84, 36.84, 38.6, 38.6, 38.6, 38.6, 33.33, 33.33, 33.33, 35.09, 45.61,
                45.61, 45.61, 45.61
            ]
        },
        {
            name: '尼泊尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.41,
                3.41,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.85,
                5.88,
                17.33,
                33.16,
                33.16,
                33.16,
                33.16,
                33.16,
                '-',
                29.48,
                29.55,
                29.58,
                29.58,
                32.73,
                32.73,
                32.73,
                32.73
            ]
        },
        {
            name: '白俄罗斯',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                10.31,
                10.31,
                10.31,
                29.36,
                29.09,
                29.09,
                29.09,
                31.82,
                31.82,
                31.82,
                31.82,
                26.61,
                26.61,
                26.61,
                27.27,
                34.55,
                34.55,
                34.55,
                40,
                40,
                40
            ]
        },
        {
            name: '比利时',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                12.67, 12.67, 23.33, 23.33, 23.33, 23.33, 35.33, 34.67, 34.67, 34.67,
                35.33, 35.33, 38, 39.33, 38, 38, 38, 39.33, 39.33, 39.33, 38, 38, 42,
                41.33, 42
            ]
        },
        {
            name: '秘鲁',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.83,
                10.83,
                10.83,
                '-',
                18.33,
                18.33,
                18.33,
                18.33,
                18.33,
                29.17,
                29.17,
                29.17,
                27.5,
                27.5,
                21.54,
                21.54,
                21.54,
                22.31,
                22.31,
                27.69,
                27.69,
                27.69,
                30,
                26.15,
                40
            ]
        },
        {
            name: '安哥拉',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                9.55, 15.45, 15.45, 15.45, 15.45, 15.45, 15.45, 15, 15, 15, 15, 37.27,
                38.64, 38.64, 38.18, 34.09, 34.09, 36.82, 36.82, 36.82, 30.45, 30.45,
                30, 30, 29.55
            ]
        },
        {
            name: '法国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                [
                    10.92, 10.92, 10.92, 10.92, 10.92, 12.13, 12.2, 12.2, 12.2, 12.2,
                    18.2, 18.2, 18.89, 18.89, 18.89, 26.86, 26.86, 26.17, 26.17, 26.17,
                    38.99, 39.58, 39.69, 39.51, 39.51
                ]
            ]
        },
        {
            name: '摩纳哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.56, 22.22, 22.22, 22.22, 22.22, 22.22, 20.83, 20.83, 20.83, 20.83,
                20.83, 25, 26.09, 26.09, 19.05, 19.05, 20.83, 20.83, 20.83, 20.83,
                20.83, 33.33, 33.33, 33.33, 33.33
            ]
        },
        {
            name: '塞尔维亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                12,
                20.4,
                21.6,
                21.6,
                21.6,
                22,
                33.2,
                33.2,
                34,
                34,
                34,
                34.4,
                34.4,
                37.65,
                38.8,
                39.2
            ]
        },
        {
            name: '葡萄牙',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.04, 13.04, 18.7, 17.39, 18.7, 19.13, 19.13, 19.13, 21.3, 21.3, 28.26,
                28.26, 27.39, 27.39, 28.7, 28.7, 31.3, 31.3, 34.78, 34.78, 34.78, 34.78,
                38.7, 40, 40
            ]
        },
        {
            name: '阿拉伯埃及共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                1.98,
                1.98,
                1.98,
                1.98,
                2.42,
                2.42,
                2.42,
                2.86,
                1.98,
                2.04,
                1.81,
                1.81,
                1.76,
                12.7,
                1.97,
                1.97,
                '-',
                '-',
                '-',
                14.93,
                14.93,
                14.93,
                14.93,
                27.41,
                27.7
            ]
        },
        {
            name: '意大利',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.11, 11.11, 11.11, 11.11, 9.84, 9.84, 11.49, 11.53, 11.53, 17.3, 17.3,
                21.27, 21.27, 21.27, 21.59, 21.43, 31.43, 31.43, 30.95, 30.95, 30.95,
                35.71, 35.71, 35.71, 35.71
            ]
        },
        {
            name: '新加坡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.76, 4.76, 4.3, 4.3, 11.76, 11.76, 15.96, 15.96, 15.96, 21.18, 24.47,
                24.47, 23.4, 23.4, 22.22, 24.24, 24.24, 25.25, 23.91, 23.76, 23, 23, 23,
                29.47, 29.81
            ]
        },
        {
            name: '苏丹',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.25,
                5.25,
                '-',
                '-',
                9.72,
                9.72,
                9.72,
                9.72,
                14.67,
                17.78,
                18.06,
                18.06,
                18.92,
                25.56,
                24.58,
                24.58,
                24.58,
                24.29,
                30.52,
                30.52,
                30.52,
                30.52,
                '-',
                '-',
                '-'
            ]
        },
        {
            name: '克罗地亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.87,
                7.87,
                7.87,
                20.53,
                20.53,
                20.53,
                '-',
                21.71,
                21.71,
                21.71,
                20.92,
                20.92,
                23.53,
                23.53,
                23.84,
                23.84,
                23.84,
                23.84,
                15.23,
                12.58,
                18.54,
                18.54,
                20.53,
                31.13,
                31.13
            ]
        },
        {
            name: '伊拉克',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.4,
                6.4,
                6.4,
                7.6,
                7.6,
                7.6,
                '-',
                '-',
                '-',
                25.45,
                25.45,
                25.45,
                25.45,
                25.23,
                25.23,
                25.23,
                25.23,
                25.3,
                26.52,
                26.52,
                25.3,
                25.23,
                25.23,
                26.44,
                28.88
            ]
        },
        {
            name: '西班牙',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                24.71, 24.71, 21.55, 28.29, 28.29, 28.29, 28.29, 36, 36, 36, 36.57,
                36.29, 36.57, 36.57, 36, 36, 36, 39.71, 41.14, 39.14, 39.14, 39.14, 44,
                44, 43.43
            ]
        },
        {
            name: '冰岛',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                25.4, 25.4, 34.92, 34.92, 34.92, 34.92, 30.16, 30.16, 33.33, 33.33,
                33.33, 33.33, 42.86, 42.86, 39.68, 39.68, 39.68, 39.68, 41.27, 47.62,
                38.1, 38.1, 38.1, 38.1, 47.62
            ]
        },
        {
            name: '摩洛哥',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                0.62, 0.62, 0.62, 0.62, 0.62, 10.77, 10.77, 10.77, 10.77, 10.77, 10.46,
                10.46, 10.46, 10.46, 16.96, 16.96, 16.96, 16.96, 16.96, 20.51, 20.51,
                20.51, 20.51, 20.51, 22.78
            ]
        },
        {
            name: '南非',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                25, 28.75, 30, 29.82, 29.82, 29.82, 29.82, 32.78, 32.75, 32.75, 33, 33,
                44.5, 44.5, 42.25, 42.25, 42.25, 41.5, 42, 42, 41.84, 42.75, 46.35,
                46.75, 46.58
            ]
        },
        {
            name: '瑞士',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                21, 21, 22.5, 23, 23, 23, 25, 25, 25, 25, 28.5, 28.5, 29, 29, 28.5, 29,
                31, 31, 32, 32, 32.5, 32.5, 41.5, 41.5, 42.5
            ]
        },
        {
            name: '新西兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                29.17, 29.17, 29.17, 30.83, 30.83, 29.17, 28.33, 28.33, 32.23, 32.23,
                33.06, 33.61, 33.61, 33.61, 32.23, 32.23, 32.23, 29.75, 31.4, 31.4,
                38.33, 38.33, 40.83, 48.33, 49.17
            ]
        },
        {
            name: '以色列',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.5, 7.5, 11.67, 12.5, 13.33, 14.17, 15, 15, 15, 14.17, 14.17, 14.17,
                18.33, 19.17, 20, 20, 22.5, 22.5, 26.67, 26.67, 27.5, 27.5, 23.33, 27.5,
                28.33
            ]
        },
        {
            name: '菲律宾',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.06, 12.44, 12.44, 11.26, 17.76, 17.76, 17.76, 15.25, 15.25, 15.25,
                20.5, 20.5, 20.97, 22.14, 22.89, 22.89, 27.34, 27.34, 27.24, 29.79,
                29.45, 29.45, 27.96, 27.96, 27.96
            ]
        },
        {
            name: '卢森堡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20, 20, 16.67, 16.67, 16.67, 16.67, 16.67, 23.33, 23.33, 23.33, 23.33,
                23.33, 20, 20, 25, 21.67, 28.33, 28.33, 28.33, 28.33, 28.33, 20, 25, 30,
                35
            ]
        },
        {
            name: '阿根廷',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                27.63,
                27.63,
                '-',
                26.46,
                '-',
                30.74,
                30.74,
                33.73,
                36.19,
                35.02,
                40,
                40,
                38.52,
                38.52,
                37.35,
                37.35,
                36.58,
                36.58,
                '-',
                35.8,
                38.13,
                38.91,
                40.16,
                40.86,
                44.75
            ]
        },
        {
            name: '哈萨克斯坦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.43, 13.43, 10.81, 10.39, 10.39, 10.39, 10.39, 10.39, 10.39, 10.39,
                15.89, 15.89, 17.76, 17.76, 17.76, 24.3, 24.3, 25.22, 26.17, 27.1, 27.1,
                27.1, 27.1, 27.1, 27.1
            ]
        },
        {
            name: '英国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                18.21, 18.21, 18.36, 18.36, 17.91, 17.91, 17.91, 18.06, 19.66, 19.66,
                19.5, 19.5, 19.5, 22, 22.31, 22.46, 22.46, 22.62, 29.38, 29.58, 32,
                32.15, 32, 33.85, 34.26
            ]
        },
        {
            name: '大韩民国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.01, 3.68, 3.68, 5.86, 5.86, 5.86, 5.86, 13.04, 13.38, 13.38, 14.38,
                13.71, 14.72, 14.72, 14.72, 15.67, 15.67, 16.33, 16.33, 17, 17, 17,
                16.67, 19, 19
            ]
        },
        {
            name: '美国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.72,
                11.72,
                13.33,
                '-',
                14.02,
                13.79,
                14.25,
                14.94,
                15.17,
                16.32,
                16.78,
                17.01,
                16.78,
                16.78,
                16.82,
                17.97,
                17.82,
                19.31,
                19.35,
                19.17,
                19.35,
                23.5,
                23.43,
                27.46,
                27.65
            ]
        },
        {
            name: '波兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                13.04, 13.04, 13.04, 13.04, 20.22, 20.22, 20.22, 20.22, 20.43, 20.43,
                20.43, 20.22, 20, 20, 23.7, 23.7, 23.7, 24.35, 27.39, 27.39, 28.04,
                28.04, 28.7, 28.7, 28.32
            ]
        },
        {
            name: '澳大利亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.54,
                15.54,
                22.45,
                22.97,
                '-',
                25.33,
                25.33,
                24.67,
                24.67,
                24.67,
                26.67,
                26.67,
                27.33,
                24.67,
                24.67,
                24.67,
                26,
                26,
                26.67,
                28.67,
                28.67,
                28.67,
                30.46,
                30.46,
                31.13
            ]
        },
        {
            name: '希腊',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.33, 6.33, 6.33, 8.67, 8.67, 8.67, 8.67, 14, 13, 13, 14.67, 14.67,
                17.33, 17.33, 18.67, 21, 21, 21, 19.67, 19.67, 18.33, 18.67, 20.67,
                21.67, 21.67
            ]
        },
        {
            name: '土耳其',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.36,
                2.36,
                4.18,
                4.18,
                4.18,
                '-',
                4.36,
                4.36,
                4.36,
                4.36,
                9.11,
                9.11,
                9.11,
                9.11,
                14.18,
                14.18,
                14.42,
                14.42,
                14.91,
                14.91,
                14.57,
                17.45,
                17.45,
                17.32,
                17.33
            ]
        },
        {
            name: '南亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.76, 6.05, 7.01, 8.44, 8.12, 9.09, 9.2, 9.02, 13.28, 12.84, 14.26,
                18.44, 20.05, 20.05, 20.34, 20.34, 15.75, 19.24, 19.32, 19.39, 19.4,
                17.1, 18.96, 18.92, 18.99
            ]
        },
        {
            name: '芬兰',
            type: 'line',
            legendHoverLink: true,
            symbolSize: 7,
            lineStyle: {
                width: 2
            },
            color: 'rgb(187,95,86)',
            data: [
                33.5, 33.5, 37, 36.5, 36.5, 36.5, 37.5, 37.5, 37.5, 38, 41.5, 41.5, 40,
                40, 42.5, 42.5, 42.5, 42.5, 41.5, 41.5, 42, 42, 47, 46, 46
            ]
        },
        {
            name: '荷兰',
            type: 'line',
            smooth: true,
            color: '#D0D0D0',
            lineStyle: {
                width: 1
            },
            data: [
                31.33, 36, 36, 36, 36, 34, 36.67, 36.67, 36.67, 36.67, 39.33, 41.33, 42,
                40.67, 40.67, 38.67, 38.67, 38.67, 37.33, 37.33, 36, 36, 31.33, 33.33,
                39.33
            ]
        },
        {
            name: '爱尔兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                12.05, 12.05, 12.05, 12.05, 12.05, 13.25, 13.25, 13.25, 13.25, 13.25,
                13.25, 13.25, 13.94, 13.94, 15.06, 15.06, 15.66, 15.66, 16.27, 22.15,
                22.15, 22.15, 22.15, 22.5, 22.5
            ]
        },
        {
            name: '德国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                26.19, 26.19, 30.94, 30.94, 31.08, 32.17, 32.17, 32.75, 31.76, 31.6,
                31.65, 32.19, 32.8, 32.8, 32.9, 32.9, 36.45, 36.45, 36.45, 36.45, 30.75,
                30.75, 30.89, 31.17, 34.92
            ]
        },
        {
            name: '加拿大',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20.6,
                20.6,
                20.6,
                '-',
                20.6,
                20.6,
                20.6,
                21.1,
                21.1,
                20.78,
                21.31,
                22.08,
                22.08,
                22.08,
                24.76,
                24.68,
                24.68,
                25.08,
                26.04,
                26.04,
                26.27,
                26.95,
                28.99,
                28.99,
                30.47
            ]
        },
        {
            name: '加蓬',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                8.33,
                8.33,
                8.33,
                9.17,
                9.17,
                9.24,
                9.24,
                9.24,
                9.24,
                12.5,
                16.67,
                16.67,
                14.66,
                14.66,
                14.17,
                15.79,
                15.79,
                15,
                14.17,
                14.17,
                17.09,
                '-',
                17.91,
                14.79,
                16.2
            ]
        },
        {
            name: '卡塔尔',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                0,
                9.76,
                9.76,
                9.76,
                9.76,
                4.44
            ]
        },
        {
            name: '加蓬',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                8.33,
                8.33,
                8.33,
                9.17,
                9.17,
                9.24,
                9.24,
                9.24,
                9.24,
                12.5,
                16.67,
                16.67,
                14.66,
                14.66,
                14.17,
                15.79,
                15.79,
                15,
                14.17,
                14.17,
                17.09,
                '-',
                17.91,
                14.79,
                16.2
            ]
        },
        {
            name: '巴西',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                6.63, 6.63, 5.65, 5.65, 6.82, 6.24, 8.58, 8.58, 8.58, 8.77, 8.97, 8.97,
                8.77, 8.58, 8.58, 8.58, 8.58, 9.94, 9.94, 9.94, 10.72, 15.01, 15.01,
                14.62, 15.2
            ]
        },
        {
            name: '挪威',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                36.36, 36.36, 36.36, 36.36, 35.76, 36.36, 36.36, 38.18, 37.87, 37.87,
                36.09, 36.09, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64, 39.64,
                41.42, 41.42, 40.83, 41.42, 44.97
            ]
        },
        {
            name: '印度',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                7.16, 8.1, 8.44, 9.01, 8.84, 8.84, 8.84, 8.26, 8.29, 8.26, 9.06, 9.06,
                10.83, 10.83, 11.01, 11.01, 11.01, 11.42, 11.97, 11.97, 11.81, 11.81,
                14.39, 14.36, 14.44
            ]
        },
        {
            name: '马来西亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                7.81,
                7.81,
                7.81,
                7.81,
                5.26,
                12.5,
                12.5,
                12.5,
                12.5,
                12.5,
                12.5,
                9.59,
                10.96,
                10.96,
                10.96,
                10.96,
                10.96,
                9.86,
                12.33,
                12.33,
                12.33,
                10.96
            ]
        },
        {
            name: '瑞典',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                40.4, 40.4, 42.69, 42.69, 42.69, 44.99, 45.27, 45.27, 45.27, 47.28,
                46.99, 46.99, 46.42, 44.99, 44.7, 44.7, 44.99, 44.7, 43.55, 43.55,
                43.55, 46.13, 47.28, 46.99, 46.99
            ]
        },
        {
            name: '丹麦',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                32.96,
                37.43,
                37.43,
                37.43,
                '-',
                37.99,
                37.99,
                37.99,
                36.87,
                36.87,
                37.99,
                37.99,
                37.99,
                37.99,
                39.11,
                39.11,
                39.11,
                39.11,
                37.43,
                37.43,
                37.43,
                37.43,
                39.11,
                39.66,
                39.66
            ]
        },
        {
            name: '日本',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                4.6, 4.6, 4.6, 7.29, 7.29, 7.29, 7.08, 7.08, 8.96, 9.38, 9.38, 9.38,
                11.25, 11.25, 10.83, 7.92, 8.13, 8.13, 9.47, 9.47, 10.11, 10.11, 10.11,
                9.89, 9.68
            ]
        },
        {
            name: '匈牙利',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.4, 8.29, 8.29, 8.29, 8.29, 9.07, 9.84, 9.09, 9.09, 10.36, 11.14,
                11.14, 11.14, 9.07, 8.81, 8.81, 8.81, 10.05, 10.1, 10.1, 10.05, 12.56,
                12.56, 12.06, 13.07
            ]
        },
        {
            name: '中国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                21.82,
                21.82,
                21.78,
                21.78,
                21.78,
                20.23,
                20.23,
                20.27,
                20.27,
                20.62,
                21.33,
                21.33,
                21.33,
                21.32,
                21.32,
                23.4,
                23.4,
                23.62,
                23.62,
                24.25,
                24.9,
                24.94,
                24.94,
                24.94
            ]
        },
        {
            name: '刚果（布）',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                12,
                12,
                12,
                12,
                '-',
                8.53,
                8.53,
                8.53,
                8.53,
                7.3,
                7.3,
                7.3,
                7.3,
                7.3,
                7.35,
                7.35,
                7.35,
                7.35,
                7.35,
                11.26,
                11.26,
                11.26,
                11.26,
                11.26
            ]
        },
        {
            name: '朝鲜民主主义人民共和国',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                '-',
                20.09,
                20.09,
                20.09,
                20.09,
                20.09,
                15.57,
                15.57,
                15.57,
                15.57,
                15.57,
                16.3,
                16.3,
                16.3,
                16.3,
                16.3,
                17.61,
                17.61,
                17.61
            ]
        },
        {
            name: '斯里兰卡',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.33,
                5.33,
                4.89,
                '-',
                '-',
                4.44,
                4.44,
                4.89,
                4.89,
                4.89,
                5.78,
                5.78,
                5.78,
                5.33,
                5.78,
                5.78,
                5.78,
                5.78,
                4.89,
                5.78,
                5.78,
                5.78,
                5.33,
                5.38,
                5.38
            ]
        },
        {
            name: '阿富汗',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                '-',
                27.31,
                27.31,
                27.69,
                27.69,
                27.31,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                27.71,
                '-',
                27.87,
                27.02,
                27.02
            ]
        },
        {
            name: '乌克兰',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                3.78,
                '-',
                7.78,
                7.78,
                7.78,
                '-',
                5.33,
                5.33,
                5.33,
                8.67,
                8.22,
                8.22,
                8,
                8,
                8,
                9.44,
                9.44,
                11.67,
                12.09,
                12.02,
                12.29,
                12.29,
                20.52,
                20.8,
                20.8
            ]
        },
        {
            name: '立陶宛',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                17.52, 17.52, 17.52, 10.64, 10.64, 10.64, 10.64, 21.99, 21.99, 24.82,
                22.7, 17.73, 19.15, 19.15, 19.15, 24.46, 24.11, 24.11, 23.4, 21.28,
                21.28, 21.28, 21.28, 26.95, 27.66
            ]
        },
        {
            name: '牙买加',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                11.67,
                13.56,
                13.33,
                13.33,
                13.33,
                '-',
                11.67,
                11.67,
                11.67,
                11.67,
                13.33,
                13.33,
                13.33,
                13.33,
                12.7,
                12.7,
                12.7,
                12.7,
                12.7,
                17.46,
                17.46,
                17.46,
                17.46,
                28.57,
                28.57
            ]
        },
        {
            name: '委内瑞拉',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                5.91,
                5.91,
                12.14,
                '-',
                9.7,
                9.7,
                9.7,
                9.7,
                17.37,
                17.96,
                18.56,
                18.56,
                17.47,
                16.97,
                16.97,
                16.97,
                16.97,
                16.97,
                16.97,
                14.37,
                22.16,
                22.16,
                22.16,
                22.16,
                22.16
            ]
        },
        {
            name: '撒哈拉以南非洲',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                10.21,
                10.92,
                '-',
                11.59,
                12.28,
                13.47,
                13.71,
                14.74,
                16.24,
                16.64,
                17.31,
                17.8,
                18.46,
                18.74,
                20.54,
                21.38,
                22.46,
                22.16,
                23.64,
                23.81,
                24.02,
                24.07,
                24.08,
                24.87,
                25.93
            ]
        },
        {
            name: '澳大利亚',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                15.54,
                15.54,
                22.45,
                22.97,
                '-',
                25.33,
                25.33,
                24.67,
                24.67,
                24.67,
                26.67,
                26.67,
                27.33,
                24.67,
                24.67,
                24.67,
                26,
                26,
                26.67,
                28.67,
                28.67,
                28.67,
                30.46,
                30.46,
                31.13
            ]
        },
        {
            name: '土耳其',
            type: 'line',
            lineStyle: {
                width: 1
            },

            color: '#D0D0D0',
            data: [
                2.36,
                2.36,
                4.18,
                4.18,
                4.18,
                '-',
                4.36,
                4.36,
                4.36,
                4.36,
                9.11,
                9.11,
                9.11,
                9.11,
                14.18,
                14.18,
                14.42,
                14.42,
                14.91,
                14.91,
                14.57,
                17.45,
                17.45,
                17.32,
                17.33
            ]
        }
    ],
    graphic: [
        {
            type: 'group',
            left: 0,
            bottom: '4%',
            children: [
                {
                    type: 'text',
                    z: 100,
                    left: 45,
                    top: 13,
                    style: {
                        text: '数据来源:Inter-Parliamentary Union (https://www.ipu.org/)',
                        fontSize: '10',
                        fill: '#868686'
                    }
                }
            ]
        }
    ]
};

option && myChart.setOption(option);
















window.onresize=function (){
     myChart.resize( );
}
